# Validation of salary_recency

In [5]:
import sqlalchemy 
import pandas as pd
import numpy as np
from datetime import datetime
from dateutil.relativedelta import *

In [7]:
end_date=datetime(2021,6,30)
start_date=end_date-relativedelta(months=2)
start_date=start_date.strftime('%Y-%m-01')
start_date

'2021-04-01'

In [8]:
pd.set_option('display.float_format', '{:.10f}'.format)

In [4]:
# df_transaction_base
engine=sqlalchemy.create_engine("mysql+pymysql://sony:Extenso@123@10.13.189.55/dax_raw")
df_transaction_base=pd.read_sql('fc_transaction_base',con=engine)

In [9]:
# df_deposit_facts
engine=sqlalchemy.create_engine("mysql+pymysql://sony:Extenso@123@10.13.189.55/dax_facts")
df_deposit_facts=pd.read_sql('fc_deposit_facts',con=engine)
df_deposit_facts=df_deposit_facts[["account_number","salary_recency1","salary_recency2","salary_recency3"]]

In [10]:
# Get selected fields
df_transaction_base_sal_start_end=df_transaction_base[(df_transaction_base["is_salary"]!=0) &(df_transaction_base["tran_date"]>=start_date) & (df_transaction_base["tran_date"]<=end_date)][["account_number","tran_date","lcy_amount","is_salary"]]
df_transaction_base_sal_start_end

,account_number,tran_date,lcy_amount,is_salary
134,b37fec3f5493b2c5bee43bee17e22bab3644e010,2021-04-24,10000.0000000000,3
185,b9384d39105cd0521303349089d27e429c1eebfe,2021-04-29,21850.0000000000,1
382,a41855e25ea91e585ba8d158544a64221aa442ca,2021-04-21,11372.0000000000,1
637,281b0a579e8e79a63ca3d78ea85dd7ce986ec52c,2021-05-11,22000.0000000000,3
867,5d68d568d38b90c85836a27c88b6d916ed19c2f1,2021-04-26,29700.0000000000,3
...,...,...,...,...
5499469,a39e379cab36eea32311e5c2d29d7c8925680d5b,2021-06-01,157717.6200000000,3
5499721,5fec1fcaadcc1728a200be7bff7ba81c68af4dac,2021-04-18,2399773.5299999998,3
5499727,5fec1fcaadcc1728a200be7bff7ba81c68af4dac,2021-05-18,2409663.5299999998,3
5499861,152e0f2b7dc6b36dddda69f1442e26170be9d5d8,2021-05-01,21821.4600000000,3
5499921,2a27a586b9dca379257a1aab6561a360b1ccf636,2021-04-20,648930.7700000000,3

In [11]:
# Get salary related transactions
df_transaction_base_sal_start_end["year"]=df_transaction_base_sal_start_end["tran_date"].dt.year
df_transaction_base_sal_start_end["month"]=df_transaction_base_sal_start_end["tran_date"].dt.month
df_transaction_base_sal_start_end["tran_date"]=df_transaction_base_sal_start_end["tran_date"].dt.strftime("%Y-%m-01")
df_transaction_base_sal_start_end

,account_number,tran_date,lcy_amount,is_salary,year,month
134,b37fec3f5493b2c5bee43bee17e22bab3644e010,2021-04-01,10000.0000000000,3,2021,4
185,b9384d39105cd0521303349089d27e429c1eebfe,2021-04-01,21850.0000000000,1,2021,4
382,a41855e25ea91e585ba8d158544a64221aa442ca,2021-04-01,11372.0000000000,1,2021,4
637,281b0a579e8e79a63ca3d78ea85dd7ce986ec52c,2021-05-01,22000.0000000000,3,2021,5
867,5d68d568d38b90c85836a27c88b6d916ed19c2f1,2021-04-01,29700.0000000000,3,2021,4
...,...,...,...,...,...,...
5499469,a39e379cab36eea32311e5c2d29d7c8925680d5b,2021-06-01,157717.6200000000,3,2021,6
5499721,5fec1fcaadcc1728a200be7bff7ba81c68af4dac,2021-04-01,2399773.5299999998,3,2021,4
5499727,5fec1fcaadcc1728a200be7bff7ba81c68af4dac,2021-05-01,2409663.5299999998,3,2021,5
5499861,152e0f2b7dc6b36dddda69f1442e26170be9d5d8,2021-05-01,21821.4600000000,3,2021,5
5499921,2a27a586b9dca379257a1aab6561a360b1ccf636,2021-04-01,648930.7700000000,3,2021,4

In [66]:
df_transaction_base_monthly=df_transaction_base_sal_start_end.groupby(["account_number","year","month"]).agg(
    monthly_sal=('lcy_amount',"sum"),
    tran_date=('tran_date',"first")
)
df_transaction_base_monthly.reset_index(inplace=True)
df_transaction_base_monthly=df_transaction_base_monthly[["account_number","tran_date","monthly_sal"]]
df_transaction_base_monthly
# df_transaction_base_monthly[df_transaction_base_monthly["account_number"]=="00009d049f8fae9a942ca0063f4257182af54c89"]

                                 account_number   tran_date      monthly_sal
0      00009d049f8fae9a942ca0063f4257182af54c89  2021-04-01 33931.3000000000
1      00009d049f8fae9a942ca0063f4257182af54c89  2021-05-01 41171.5000000000
2      00016b54c6bd7328b2899c137158ff0aab0099e4  2021-04-01 39722.0000000000
3      00016b54c6bd7328b2899c137158ff0aab0099e4  2021-05-01 50210.0000000000
4      00018eaa26ee0c3836b3c1d080627a3a2b3e45f5  2021-04-01 15000.0000000000
...                                         ...         ...              ...
42416  fff801e52af9d46e71a87cb7f7495374d31f8d57  2021-04-01 13340.0100000000
42417  fff99e408b8f61139022f67074b435f74062793f  2021-05-01 11566.8800000000
42418  fffc47d84b019ebf1f045de66331f981d448b3c8  2021-04-01 10207.3000000000
42419  fffef9f15af92a8025906e7bd8550ba5d33666da  2021-05-01 50000.0000000000
42420  fffef9f15af92a8025906e7bd8550ba5d33666da  2021-06-01 45000.0000000000

[42421 rows x 3 columns]

In [67]:
df_transaction_base_monthly=df_transaction_base_monthly.pivot_table('monthly_sal', ['account_number'], 'tran_date')
df_transaction_base_monthly.reset_index(inplace=True)
df_transaction_base_monthly.fillna(0,inplace=True)
df_transaction_base_monthly.columns=["account_number","salary_recency3","salary_recency2","salary_recency1"]
df_transaction_base_monthly=df_transaction_base_monthly[["account_number","salary_recency1","salary_recency2","salary_recency3"]]
df_transaction_base_monthly

,account_number,salary_recency1,salary_recency2,salary_recency3
0,00009d049f8fae9a942ca0063f4257182af54c89,0.0000000000,41171.5000000000,33931.3000000000
1,00016b54c6bd7328b2899c137158ff0aab0099e4,0.0000000000,50210.0000000000,39722.0000000000
2,00018eaa26ee0c3836b3c1d080627a3a2b3e45f5,0.0000000000,0.0000000000,15000.0000000000
3,000de06ac50d49c6ae28e75dee400b529bccca3c,0.0000000000,100000.0000000000,0.0000000000
4,0010cd908251d4e0eb684c1466f16dedf9287b5f,0.0000000000,0.0000000000,48114.0000000000
...,...,...,...,...
25663,fff7a356e2b2c470cd006eec33ecc8b0f040b677,850771.6700000000,850771.6700000000,850324.0900000000
25664,fff801e52af9d46e71a87cb7f7495374d31f8d57,0.0000000000,0.0000000000,13340.0100000000
25665,fff99e408b8f61139022f67074b435f74062793f,0.0000000000,11566.8800000000,0.0000000000
25666,fffc47d84b019ebf1f045de66331f981d448b3c8,0.0000000000,0.0000000000,10207.3000000000
25667,fffef9f15af92a8025906e7bd8550ba5d33666da,45000.0000000000,50000.0000000000,0.0000000000

In [68]:
df_qa_vs_dev=pd.merge(df_transaction_base_monthly,df_deposit_facts,how="inner",on="account_number",suffixes=('_qa','_dev'))
df_qa_vs_dev["salary_recency1_status"]=np.select(
    [
        (df_qa_vs_dev["salary_recency1_qa"]-df_qa_vs_dev["salary_recency1_dev"]<0.5)
    ],
    [
        "pass"
    ],
    default="fail"
)
df_qa_vs_dev["salary_recency2_status"]=np.select(
    [
        (df_qa_vs_dev["salary_recency2_qa"]-df_qa_vs_dev["salary_recency2_dev"]<0.5)
    ],
    [
        "pass"
    ],
    default="fail"
)
df_qa_vs_dev["salary_recency3_status"]=np.select(
    [
        (df_qa_vs_dev["salary_recency3_qa"]-df_qa_vs_dev["salary_recency3_dev"]<0.5)
    ],
    [
        "pass"
    ],
    default="fail"
)
df_qa_vs_dev

,account_number,salary_recency1_qa,salary_recency2_qa,salary_recency3_qa,salary_recency1_dev,salary_recency2_dev,salary_recency3_dev,salary_recency1_status,salary_recency2_status,salary_recency3_status
0,00009d049f8fae9a942ca0063f4257182af54c89,0.0000000000,41171.5000000000,33931.3000000000,0.0000000000,41171.5000000000,33931.3000000000,pass,pass,pass
1,00016b54c6bd7328b2899c137158ff0aab0099e4,0.0000000000,50210.0000000000,39722.0000000000,0.0000000000,50210.0000000000,39722.0000000000,pass,pass,pass
2,00018eaa26ee0c3836b3c1d080627a3a2b3e45f5,0.0000000000,0.0000000000,15000.0000000000,0.0000000000,0.0000000000,15000.0000000000,pass,pass,pass
3,000de06ac50d49c6ae28e75dee400b529bccca3c,0.0000000000,100000.0000000000,0.0000000000,0.0000000000,100000.0000000000,0.0000000000,pass,pass,pass
4,0010cd908251d4e0eb684c1466f16dedf9287b5f,0.0000000000,0.0000000000,48114.0000000000,0.0000000000,0.0000000000,48114.0000000000,pass,pass,pass
...,...,...,...,...,...,...,...,...,...,...
25152,fff7a356e2b2c470cd006eec33ecc8b0f040b677,850771.6700000000,850771.6700000000,850324.0900000000,850771.6700000000,850771.6700000000,850324.0900000000,pass,pass,pass
25153,fff801e52af9d46e71a87cb7f7495374d31f8d57,0.0000000000,0.0000000000,13340.0100000000,0.0000000000,0.0000000000,13340.0100000000,pass,pass,pass
25154,fff99e408b8f61139022f67074b435f74062793f,0.0000000000,11566.8800000000,0.0000000000,0.0000000000,11566.8800000000,0.0000000000,pass,pass,pass
25155,fffc47d84b019ebf1f045de66331f981d448b3c8,0.0000000000,0.0000000000,10207.3000000000,0.0000000000,0.0000000000,10207.3000000000,pass,pass,pass
25156,fffef9f15af92a8025906e7bd8550ba5d33666da,45000.0000000000,50000.0000000000,0.0000000000,45000.0000000000,50000.0000000000,0.0000000000,pass,pass,pass

In [69]:
df_qa_vs_dev["salary_recency1_status"].value_counts()

pass    25157
Name: salary_recency1_status, dtype: int64

In [70]:
df_qa_vs_dev["salary_recency2_status"].value_counts()

pass    25157
Name: salary_recency2_status, dtype: int64

In [71]:
df_qa_vs_dev["salary_recency3_status"].value_counts()

pass    25157
Name: salary_recency3_status, dtype: int64